In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3 as sql

In [4]:
%load_ext sql

In [5]:
cnn=sql.connect('socioeconomic.db')

In [6]:
%sql sqlite:///socioeconomic.db

In [7]:
%%sql
select name from sqlite_master

 * sqlite:///socioeconomic.db
Done.

[('chicago',), ('ix_chicago_index',), ('school',), ('ix_school_School_ID',)]

In [12]:
cr_data=pd.read_csv('datasets/ChicagoCrimeData.csv',index_col='ID')
cr_data.head(5)

,CASE_NUMBER,DATE,BLOCK,IUCR,PRIMARY_TYPE,DESCRIPTION,LOCATION_DESCRIPTION,ARREST,DOMESTIC,BEAT,DISTRICT,WARD,COMMUNITY_AREA_NUMBER,FBICODE,X_COORDINATE,Y_COORDINATE,YEAR,LATITUDE,LONGITUDE,LOCATION
ID,,,,,,,,,,,,,,,,,,,,
3512276,HK587712,2004-08-28,047XX S KEDZIE AVE,890,THEFT,FROM BUILDING,SMALL RETAIL STORE,False,False,911,9,14.0,58.0,6,1155838.0,1873050.0,2004,41.807440,-87.703956,"(41.8074405, -87.703955849)"
3406613,HK456306,2004-06-26,009XX N CENTRAL PARK AVE,820,THEFT,$500 AND UNDER,OTHER,False,False,1112,11,27.0,23.0,6,1152206.0,1906127.0,2004,41.898280,-87.716406,"(41.898279962, -87.716405505)"
8002131,HT233595,2011-04-04,043XX S WABASH AVE,820,THEFT,$500 AND UNDER,NURSING HOME/RETIREMENT HOME,False,False,221,2,3.0,38.0,6,1177436.0,1876313.0,2011,41.815933,-87.624642,"(41.815933131, -87.624642127)"
7903289,HT133522,2010-12-30,083XX S KINGSTON AVE,840,THEFT,FINANCIAL ID THEFT: OVER $300,RESIDENCE,False,False,423,4,7.0,46.0,6,1194622.0,1850125.0,2010,41.743665,-87.562463,"(41.743665322, -87.562462756)"
10402076,HZ138551,2016-02-02,033XX W 66TH ST,820,THEFT,$500 AND UNDER,ALLEY,False,False,831,8,15.0,66.0,6,1155240.0,1860661.0,2016,41.773455,-87.706480,"(41.773455295, -87.706480471)"

In [10]:
cr_data.to_sql('crime',cnn)

533

Problem 1

Find the total number of crimes recorded in the CRIME table

In [11]:
%%sql
select count(*) from crime

 * sqlite:///socioeconomic.db
Done.

[(533,)]

In [14]:
%%sql
pragma table_info(chicago)

 * sqlite:///socioeconomic.db
Done.

[(0, 'index', 'INTEGER', 0, None, 0),
 (1, 'CommunityAreaNumber', 'REAL', 0, None, 0),
 (2, 'COMMUNITYAREANAME', 'TEXT', 0, None, 0),
 (3, 'PERCENTOFHOUSINGCROWDED', 'REAL', 0, None, 0),
 (4, 'PERCENTHOUSEHOLDSBELOWPOVERTY', 'REAL', 0, None, 0),
 (5, 'PERCENTAGED16+UNEMPLOYED', 'REAL', 0, None, 0),
 (6, 'PERCENTAGED25+WITHOUTHIGHSCHOOLDIPLOMA', 'REAL', 0, None, 0),
 (7, 'PERCENTAGEDUNDER18OROVER64', 'REAL', 0, None, 0),
 (8, 'PERCAPITAINCOME', 'INTEGER', 0, None, 0),
 (9, 'HARDSHIPINDEX', 'REAL', 0, None, 0)]

Problem 2

List community area names and numbers with per capita income less than 11000.

In [16]:
%%sql
select COMMUNITYAREANAME,COMMUNITYAREANUMBER from chicago where PERCAPITAINCOME<11000

 * sqlite:///socioeconomic.db
Done.

[('West Garfield Park', 26.0),
 ('South Lawndale', 30.0),
 ('Fuller Park', 37.0),
 ('Riverdale', 54.0)]

Problem 3

List all case numbers for crimes involving minors?(children are not considered minors for the purposes of crime analysis)

In [19]:
%%sql
pragma table_info(crime)

 * sqlite:///socioeconomic.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 0),
 (1, 'CASE_NUMBER', 'TEXT', 0, None, 0),
 (2, 'DATE', 'TEXT', 0, None, 0),
 (3, 'BLOCK', 'TEXT', 0, None, 0),
 (4, 'IUCR', 'TEXT', 0, None, 0),
 (5, 'PRIMARY_TYPE', 'TEXT', 0, None, 0),
 (6, 'DESCRIPTION', 'TEXT', 0, None, 0),
 (7, 'LOCATION_DESCRIPTION', 'TEXT', 0, None, 0),
 (8, 'ARREST', 'INTEGER', 0, None, 0),
 (9, 'DOMESTIC', 'INTEGER', 0, None, 0),
 (10, 'BEAT', 'INTEGER', 0, None, 0),
 (11, 'DISTRICT', 'INTEGER', 0, None, 0),
 (12, 'WARD', 'REAL', 0, None, 0),
 (13, 'COMMUNITY_AREA_NUMBER', 'REAL', 0, None, 0),
 (14, 'FBICODE', 'TEXT', 0, None, 0),
 (15, 'X_COORDINATE', 'REAL', 0, None, 0),
 (16, 'Y_COORDINATE', 'REAL', 0, None, 0),
 (17, 'YEAR', 'INTEGER', 0, None, 0),
 (18, 'LATITUDE', 'REAL', 0, None, 0),
 (19, 'LONGITUDE', 'REAL', 0, None, 0),
 (20, 'LOCATION', 'TEXT', 0, None, 0)]

In [28]:
%%sql
select case_number from crime where description like '%MINOR%'

 * sqlite:///socioeconomic.db
Done.

[('HL266884',), ('HK238408',)]

Problem 4

List all kidnapping crimes involving a child?

In [32]:
%%sql
select * from crime where description like '%CHILD%' and primary_type='KIDNAPPING'

 * sqlite:///socioeconomic.db
Done.

[(5276766, 'HN144152', '2007-01-26', '050XX W VAN BUREN ST', '1792', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER', 'STREET', 0, 0, 1533, 15, 29.0, 25.0, '20', 1143050.0, 1897546.0, 2007, 41.87490841, -87.75024931, '(41.874908413, -87.750249307)')]

Problem 5

List the kind of crimes that were recorded at schools. (No repetitions)

In [38]:
%%sql
select distinct(primary_type),location_description from crime where LOCATION_DESCRIPTION like '%school%'

 * sqlite:///socioeconomic.db
Done.

[('BATTERY', 'SCHOOL, PUBLIC, GROUNDS'),
 ('BATTERY', 'SCHOOL, PUBLIC, BUILDING'),
 ('CRIMINAL DAMAGE', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'SCHOOL, PUBLIC, BUILDING'),
 ('ASSAULT', 'SCHOOL, PUBLIC, GROUNDS'),
 ('CRIMINAL TRESPASS', 'SCHOOL, PUBLIC, GROUNDS'),
 ('PUBLIC PEACE VIOLATION', 'SCHOOL, PRIVATE, BUILDING'),
 ('PUBLIC PEACE VIOLATION', 'SCHOOL, PUBLIC, BUILDING')]

Problem 6

List the type of schools along with the average safety score for each type.

In [55]:
%%sql
select "Elementary, Middle, or High School" as schools, CAST(avg(SAFETY_SCORE) as INTEGER) as "SAFETY SCORE" from school 
group by schools;

 * sqlite:///socioeconomic.db
Done.

[('ES', 49), ('HS', 49), ('MS', 48)]

Problem 7

List 5 community areas with highest % of households below poverty line

In [58]:
%%sql
select COMMUNITYAREANAME,PERCENTHOUSEHOLDSBELOWPOVERTY from chicago order by PERCENTHOUSEHOLDSBELOWPOVERTY desc limit 5

 * sqlite:///socioeconomic.db
Done.

[('Riverdale', 56.5),
 ('Fuller Park', 51.2),
 ('Englewood', 46.6),
 ('North Lawndale', 43.1),
 ('East Garfield Park', 42.4)]

Problem 8

Which community area is most crime prone? Display the coumminty area number only.

In [62]:
%%sql
select COMMUNITY_AREA_NUMBER,count(COMMUNITY_AREA_NUMBER) as frequency from crime group by community_area_number
order by frequency desc limit 1

 * sqlite:///socioeconomic.db
Done.

[(25.0, 43)]

Problem 9

Use a sub-query to find the name of the community area with highest hardship index

In [73]:
%%sql
select COMMUNITYAREANAME from chicago where HARDSHIPINDEX in (select max(HARDSHIPINDEX) from chicago)

 * sqlite:///socioeconomic.db
Done.

[('Riverdale',)]

Problem 10

Use a sub-query to determine the Community Area Name with most number of crimes?

In [68]:
%%sql
select COMMUNITY_AREA_Number,count(COMMUNITY_AREA_NUMBER) as frequency from crime group by community_area_number
order by frequency desc limit 1

 * sqlite:///socioeconomic.db
Done.

[(25.0, 43)]

In [72]:
%%sql
select communityareaname from chicago where communityareanumber =
(select COMMUNITY_AREA_Number from crime group by community_area_number
order by count(COMMUNITY_AREA_NUMBER) desc limit 1) limit 1

 * sqlite:///socioeconomic.db
Done.

[('Austin',)]